Tekla Open API Reference for Tekla Structures 2025
Operation.Open Method
Overload List
Name | Description
Open(String) |  Obsolete.
Opens a new model to Tekla Structures ignoring auto saved information.
Open(String, Boolean) |  Obsolete.
Opens a new model to Tekla Structures.
Top
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace